Repository: autohotkey-docs-translation/v1-fr
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr

source: After editing a script, you must run or reload the script for the changes to take effect.
fr: Après la modification d'un script, il faut exécuter ou recharger le script pour que les modifications prennent effet.

source: After removing the keys it takes all higher numbered/integer keys and moves them down to fill the gap, so that if there was a value at Index + Length it will now be at Index.
fr: Après avoir enlevé les clés, les autres clés plus grandes sont décalées vers le bas pour combler le trou, donc une valeur précédemment en Index + Longueur se retrouve en Index.

source: After the script has been loaded, it begins executing at the top line, continuing until a Return, Exit, hotkey/hotstring label, or the physical end of the script is encountered (whichever comes first).
fr: Une fois que le script a été chargé, l'exécution commence à la ligne du haut, et continue jusqu'à ce que Return, Exit, ou un label hotkey/hotstring, ou la fin physique du script soit atteinte (selon ce qui arrive en premier).

source: After the script has been loaded, it begins executing at the top line, continuing until a Return, Exit, the script's first hotkey/hotstring label, or the physical end of the script is encountered (whichever comes first).
fr: Après que le script ait été chargé, l'exécution commence à la ligne du haut, et continue jusqu'à un Return, Exit, le premier hotkey/hotstring, ou la fin physique du script (selon ce qui arrive en premier).

source: Ahk2Exe can be used in the following ways:
fr: Ahk2Exe peut être utilisé des manières suivantes :

source: Ahk2Exe optionally uses MPRESS (a freeware program by MATCODE Software) to compress compiled scripts.
fr: Ahk2Exe utilise MPRESS de manière facultative (un logiciel gratuit par MATCODE Software) pour compresser les scripts compilés.

source: Ahk2Exe.exe /in "MyScript.ahk" /icon "MyIcon.ico"
fr: Ahk2Exe.exe /in "MonScript.ahk" /icon "MonIcone.ico"

source: Ahk2Exe.exe /in MyScript.ahk [/out MyScript.exe] [/icon MyIcon.ico] [/bin AutoHotkeySC.bin] [/mpress 0or1]
fr: Ahk2Exe.exe /in MonScript.ahk [/out MonScript.exe] [/icon MonIcone.ico] [/bin AutoHotkeySC.bin] [/mpress 0ou1]

source: All in one big happy script file.
fr: Tout cela dans un unique fichier de script ventru et heureux.

source: All of the following are valid:
fr: Tout ce qui suit est valide :

source: All parameters support the percent-space prefix except for:
fr: Tous les paramètres sont compatibles avec le préfixe pourcentage-espace sauf :

source: All you have to do is put your bracket notation on the left side of an expression assignment operator :=.
fr: Tout ce qu'il y a à faire est de mettre la notation crochet du côté gauche de l'opérateur d'affectation par expression :=.

source: Allows semicolon comments inside the continuation section (but not /*..*/).
fr: Permet les commentaires point-virgule dans la section de continuation (mais pas /*..*/).

source: Allows you to remove a range of numbered/integer or string keys between FirstKey and LastKey.
fr: Enlève une suite de clés entre PremiereClef et DerniereClef, entiers ou chaînes de caractères.

source: Also note that Ahk2Exe saves settings to the following registry key:
fr: A noter également que Ahk2Exe enregistre les paramètres à la clé de registre suivante :

source: Also note that each thread retains its own collection of the above settings.
fr: A noter que chaque fil d'exécution a son propre ensemble de valeurs pour les paramètres ci-dessus.

source: Also note that the pressing of joystick buttons always "passes through" to the active window if that window is designed to detect the pressing of joystick buttons.
fr: Notez également que la détection des boutons du joystick "passe à travers" à la fenêtre active si cette fenêtre est conçue pour détecter la pression des boutons du joystick.

source: Also refer to the following question:
fr: Se référer également à la question suivante :

source: Also, a hotkey that executes more than one line must list its first line beneath the hotkey, not on the same line.
fr: De plus, une hotkey qui exécute plus d'une ligne doit avoir sa première ligne sous la hotkey, pas sur la même ligne.

source: Also, the built-in variable A_Now contains the current local time.
fr: Aussi, la variable intégrée A_Now contient le temps actuel local.

source: Also, the value 3 is stored in the object key "Price".
fr: et la valeur 3 est stocké dans la clé "Prix" de l'objet.

source: Also, this option may be turned on for multiple continuation sections by specifying #LTrim on a line by itself.
fr: De plus, cette option peut être activée pour plusieurs sections de continuation en indiquant #LTrim sur une ligne séparée.

source: Also, this option transforms only those commas that actually delimit parameters.
fr: De plus, cette option ne transforme que les virgules délimitant réellement un paramètre.

source: Also, with the Send commands you are able to send more than one letter, number or symbol at a time.
fr: De plus, avec la commande Send il est possible d'envoyer plus d'un nombre, lettre ou symbole d'un coup.

source: Alternatively, you can create a script file (something.ahk) anywhere you like, and run the script file instead of running AutoHotkey.
fr: Alternativement, il est possible de créer un fichier de script (quelquechose.ahk) n'importe où, et d'exécuter le fichier de script au lieu de lancer AutoHotkey.

source: Although AutoHotkey supports Unicode text, it is optimized for backward-compatibility, which means defaulting to the ANSI encoding rather than the more internationally recommended UTF-8.
fr: Bien que AutoHotkey soit compatible avec du texte Unicode, il est optimisé pour la rétrocompatibilité, ce qui signifie que le choix par défaut est l'encodage ANSI plutôt que l'UTF-8 pourtant davantage recommandé dans le monde entier.

source: Although any single character can be used as a key name, its meaning (scan code or virtual keycode) depends on the current keyboard layout.
fr: Bien que n'importe quel caractère unique puisse être utilisé comme nom de touche, sa signification (code de balayage ou code de touche virtuel) dépend de la disposition actuelle du clavier.

source: Although it is certainly possible that the file has been infected, most often these alerts are false positives, meaning that the antivirus program is mistaken.
fr: Bien qu'il soit possible que le fichier ait été infecté, le plus souvent ces alertes sont des faux positifs, c'est-à-dire que le programme antivirus se trompe.

source: Although it is present in Windows Vista and later, it is enabled by default on new systems or new installs, and it is more difficult to disable on Windows 8 and later.
fr: Bien que présent depuis Windows Vista, il est activé par défaut sur les nouveaux systèmes ou nouvelles installations, et est plus difficile à désactiver à partir de Windows 8.

source: Although it isn't valid to use Params* just anywhere, it can be used in an array literal ([A, B, C, ArrayToAppend*]) or indexer (Alpha[Params*]).
fr: Bien qu'il ne soit pas valide d'utiliser Params* n'importe où, la syntaxe s'utilise aussi dans un tableau littéral ([A, B, C, TableauAAjouter*]) ou en index (Alpha[Params*]).

source: Although many scripts written for AutoHotkey 1.0 do not require changes to run on AutoHotkey 1.1, some may function incorrectly due to necessary differences between the two versions.
fr: Bien que de nombreux scripts écrits pour AutoHotkey 1.0 ne nécessitent pas de modifications pour s'exécuter sur AutoHotkey 1.1, certains peuvent fonctionner de manière incorrecte en raison des différences nécessaires entre les deux versions.

source: Although purely numeric parameters accept an expression by default, all other parameters of commands do not.
fr: Bien que les paramètres purement numériques acceptent une expression par défaut, ce n'est le cas d'aucun autre des paramètres de commande.

source: Although the following Joystick control names cannot be used as hotkeys, they can be used with GetKeyState:
fr: Bien que les noms de contrôle du joystick suivants ne puissent pas être utilisés comme hotkey, ils peuvent être utilisés avec GetKeyState:

source: Although the indentation used in the examples above is optional, it might improve clarity by indicating which lines belong to ones above them.
fr: Bien que l'indentation utilisée dans les exemples ci-dessus soit facultative, elle peut améliorer la clarté en indiquant les lignes appartenant à celles au-dessus.

source: Although the message will not appear at the command prompt, it can be "caught" by means such as redirecting output to a file.
fr: Bien que le message n'apparaisse pas dans le terminal, il peut être "attrapé" par des méthodes telles que la redirection de la sortie vers un fichier.

source: Although this looks like a function call, ClassName is actually an ordinary variable.
fr: Bien que ceci ressemble à un appel de fonction, NomClasse est en fait une variable ordinaire.

source: Although this method is especially useful for auto-replace hotstrings, it can also be used with any command or expression.
fr: Bien que cette méthode soit surtout utile pour les hotstrings à remplacement automatique, elle peut aussi être utilisée avec n'importe quelle commande ou expression.

source: An If statement causes its body to be executed or not depending on a condition.
fr: Une instruction If (si) fait que son corps est exécuté ou non selon une condition.

source: An escape character is usually used to indicate that the character immediately following it should be interpreted differently than it normally would.
fr: Un caractère d'échappement est généralement utilisé pour indiquer que le caractère qui le suit immédiatement devrait être interprété différemment.

source: An AutoHotkey script is basically a set of instructions for the program to follow, written in a custom language exclusive to AutoHotkey.
fr: Un script AutoHotkey est simplement un ensemble d'instructions suivies par le programme, écrites dans un langage personnalisé exclusif à AutoHotkey.

source: An ampersand may be used between any two keys or mouse buttons to combine them into a custom hotkey.
fr: Une esperluette peut être utilisée entre deux touches ou boutons de la souris quelconques pour former une hotkey personnalisée.

source: An associative array is a collection of data where each item has a name.
fr: Un tableau associatif est un ensemble de données où chaque élément a un nom.

source: An example showing what shouldn't be done to a hotkey:
fr: Un exemple de ce qu'il ne faut pas faire pour une hotkey :

source: An expression statement is an expression used on its own, typically for its side-effects.
fr: Une instruction expression est une expression utilisée seule, typiquement pour ses effets de bord.

source: An indexed array is an object representing a list of items, numbered 1 and up.
fr: Un tableau indexé est un objet représentant une liste d'éléments, numérotés à partir de 1.

source: An object is basically a collection of variables.
fr: Un objet est simplement un ensemble de variables.

source: And for compiled scripts, the format is:
fr: Et pour les scripts compilés, la syntaxe est :

source: And the content needs to go below, followed by a return.
fr: Et le contenu doit se situer en-dessous, suivi par un return.

source: And while you wait for help, you can try learning and doing it yourself.
fr: Et pendant que vous attendez de l'aide, vous pouvez essayer d'apprendre et de résoudre le problème seul.

source: Another common issue is that people think that everything needs to be wrapped in brackets with the Send command.
fr: Un autre problème courant est de penser que tout doit être mis entre accolades avec la commande Send.

source: Another example is Join`r`n, which inserts CR+LF between lines.
fr: Un autre exemple est Join`r`n, qui insère CR+LF entre les lignes.

source: Any label can be used as the starting point of a subroutine.
fr: N'importe quel label peut être utilisé comme point de départ d'un sous-programme.

source: Any If statement which does not match one of the usages shown above is interpreted as If (expression).
fr: Toute instruction If qui ne suit pas l'une des utilisations ci-dessus est interprétée comme If (expression).

source: Any advice?
fr: Des conseils ?

source: Any lines you want to execute immediately when the script starts should appear at the top of the script, prior to the first hotkey, hotstring, or Return.
fr: Toutes les lignes à exécuter immédiatement au lancement du script devraient apparaître tout en haut du script, avant le premier hotkey, hotstring, ou Return.

source: Any parameter that contains spaces should be enclosed in quotation marks.
fr: Tout paramètre contenant des espaces doit être entouré de guillemets.

source: Any syntax errors will be displayed, and they must be corrected before the script can run.
fr: Les erreurs de syntaxe seront affichées, et doivent être corrigées pour que le script puisse être exécuté.

source: Any text needs to be in quotes.
fr: Tout texte doit être mis entre guillemets.

source: Anything inside of these brackets are OPTIONAL.
fr: Tout ce qui est entre ces crochets est OPTIONEL.

source: Anything to the left of :: are the keys you need to press.
fr: Ce qui se trouve à gauche de :: sont les touches à enfoncer.

source: Apples are a fruit.
fr: Les pommes sont des fruits.

source: Array function
fr: Fonction Array (tableau)

source: As a consequence of the above, semicolons never need to be escaped within a continuation section.
fr: En conséquence, les point-virgules n'ont pas à être échappés dans une section de continuation.

source: As a hotkey (Alt::) it fires upon release unless it has the tilde prefix.
fr: En tant que hotkey (Alt ::), il se déclenche au relâchement à moins qu'il ait le préfixe tilde.

source: As a hotkey (Control::) it fires upon release unless it has the tilde prefix.
fr: En tant que hotkey (Control ::), il se déclenche au relâchement à moins qu'il ait le préfixe tilde.

source: As a hotkey (Shift::) it fires upon release unless it has the tilde prefix.
fr: En tant que raccourci clavier (Shift ::), il se déclenche au relâchement à moins qu'il ait le préfixe tilde.

source: As all text is converted (where necessary) to the native string format, characters which are invalid or don't exist in the native codepage are replaced with a placeholder:
fr: Comme tout le texte est converti (si nécessaire) vers le format natif de chaîne de caractères, les caractères qui sont invalides ou n'existent pas dans le codepage natif sont remplacés par :

source: As directives, labels (including hotkeys and hotstrings), and declarations without assignments are processed when the script is loaded from file, they are not subject to control flow.
fr: Comme les directives, les labels (y compris hotkeys et hotstrings), et les déclarations sans affectation sont traitées quand le script est chargé depuis le fichier, ils ne sont pas soumis au flux de contrôle.

source: As of v1.1.01, password protection and the /NoDecompile switch are not supported.
fr: A partir de v1.1.01, la protection par mot de passe et le commutateur /NoDecompile ne sont plus pris en charge.

source: As of v1.1.01, the compiled script can be edited instead of AutoHotkeySC.bin.
fr: A partir de v1.1.01, le script compilé peut être modifié à la place de AutoHotkeySC.bin.

source: As stated above, functions are different because they use parentheses.
fr: Comme indiqué ci-dessus, les fonctions sont différentes car elles utilisent des parenthèses.

source: As the default AutoHotkey installation does not include a compressor, compiled scripts are not compressed by default.
fr: Comme l'installation AutoHotkey par défaut ne comprend pas de compresseur, les scripts compilés ne sont par défaut pas compressés.

source: As the individual elements are just normal variables, one can assign or retrieve a value, but cannot remove or insert elements.
fr: Comme les éléments individuels sont juste des variables normales, il est possible d'affecter ou de récupérer une valeur, mais pas d'enlever ou d'insérer des éléments.

source: As the most problematic differences only affect advanced functionality like DllCall(), most users do not need to be concerned.
fr: Comme les différences les plus problématiques n'affectent que les fonctionnalités avancées comme DllCall (), la plupart des utilisateurs n'ont pas besoin de s'inquiéter.

source: As with function calls, there must be no space between the function name and open-parenthesis.
fr: Comme avec les appels de fonction, il ne doit pas y avoir d'espace entre le nom de la fonction et la parenthèse ouvrante.

source: Asking for Help
fr: Demander de l'Aide

source: Assignments, as in x := y, compound assignments such as x += y, and increment/decrement operators such as ++x and x--.
fr: Les affectations, comme x := y, les affectations augmentées comme x += y, et les opérateurs d'incrémentation/de décrémentation comme ++x et x--.

source: Associative pseudo-arrays
fr: Pseudo-tableaux associatifs

source: At first, it would appear that percent signs have a different meaning depending on whether they are used in text or in an expression.
fr: Au premier abord, il semblerait que les signes pourcentage aient une signification différente selon s'ils sont utilisés dans du texte ou dans une expression.

source: At the top of each page which documents a command, there is usually a block showing syntax, like this:
fr: En haut de chaque page documentant une commande, se trouve en général un bloc montrant la syntaxe, comme ceci :

source: Auto-execute Section
fr: Section d'Auto-exécution

source: Auto-replace hotstrings do not act as labels.
fr: Les hotstrings de remplacement automatique ne se comportent pas comme des labels.

source: AutoHotkey /Debug "myscript.ahk"
fr: AutoHotkey /Debug "monscript.ahk"

source: AutoHotkey /Debug=localhost:9000 "myscript.ahk"
fr: AutoHotkey /Debug=localhost:9000 "monscript.ahk"

source: AutoHotkey 1.1 is also known as "AutoHotkey_L", while AutoHotkey 1.0 was retrospectively labelled "AutoHotkey Basic".
fr: AutoHotkey 1.1 est également connu sous le nom de "AutoHotkey_L", tandis qu'AutoHotkey 1.0 a été rétrospectivement étiqueté "AutoHotkey Basic".

source: AutoHotkey Beginner Tutorial by tidbit
fr: Tutoriel AutoHotkey Débutant par tidbit

source: AutoHotkey also creates one global pseudo-array to contain any command line parameters that were passed to the script.
fr: AutoHotkey créé aussi un pseudo-tableau global pour contenant les paramètres de ligne de commande passés au script.

source: AutoHotkey doesn't do anything on its own; it needs a script to tell it what to do.
fr: AutoHotkey ne fait rien par lui-même ; il lui faut un script pour lui dire quoi faire.

source: AutoHotkey has only one ternary operator, which takes the form condition ? valueIfTrue : valueIfFalse.
fr: AutoHotkey n'a qu'un opérateur ternaire, qui prend la forme condition ? valeurSiVrai : valeurSiFaux.

source: AutoHotkey has the ability to have as many hotkeys and hotstrings in one file as you want.
fr: AutoHotkey permet d'avoir un nombre quelconque de hotkeys et de hotstrings dans un même fichier.

source: AutoHotkey has two main types of things used by the scripter to create code:
fr: AutoHotkey permet à un scripter d'écrire du code de deux principales manières :

source: AutoHotkey is not magic, we all wish it was, but it is not.
fr: AutoHotkey n'est pas de la magie, tout le monde aimerait bien, mais ce n'en est pas.

source: AutoHotkey will not automatically recognize a UTF-8 file unless it begins with a byte order mark.
fr: AutoHotkey ne reconnaîtra pas automatiquement un fichier UTF-8 à moins qu'il ne commence par un indicateur d'ordre des octets (Byte Order Mark).

source: AutoHotkey's installer comes packaged as a 7-zip self-extracting archive which attempts to extract to the user's Temp directory and execute a compiled script.
fr: L'installateur de AutoHotkey est fourni empaqueté comme archive 7-zip auto-extractrice qui essaie d'extraire dans le dossier Temp de l'utilisateur et d'exécuter un script compilé.

source: AutoHotkey.ahk is launched instead of AutoHotkey.ini
fr: AutoHotkey.ahk est lancé à la place d'AutoHotkey.ini

source: AutoHotkey.exe /Debug=SERVER:PORT ...
fr: AutoHotkey.exe /Debug=SERVEUR:PORT ...

source: AutoHotkey.exe [Switches] [Script Filename] [Script Parameters]
fr: AutoHotkey.exe [Commutateurs] [Nom de Fichier du Script] [Paramètres du Script]

source: Back
fr: Page précédente

source: Backspace
fr: Suppr arrière

source: Backspace (or BS)
fr: Backspace (ou BS)

source: Banana := Object("Color", "Yellow", "Taste", "Delicious", "Price", 3)
fr: Banane := Object("Couleur", "Jaune", "Gout", "Délicieux", "Prix", 3)

source: Banana := {"Color":
fr: Banane := {"Couleur":

source: Banana.Consistency := ""
fr: Banane.Consistance := ""

source: Banana.Consistency := "Mushy"
fr: Banane.Consistance := "Purée"

source: Banana["Pickled"] := True
fr: Banane["Vinaigrée"] := True

source: Basically:
fr: Simplement :

source: Be kind.
fr: Être gentil.

source: Be open.
fr: Être ouvert.

source: Be patient.
fr: Être patient.

source: Be polite.
fr: Être poli.

source: Be sure to save the file as UTF-8 with BOM if it will contain non-ASCII characters.
fr: Bien enregistrer le fichier en UTF-8 avec BOM si il sera amené à contenir des caractères hors ASCII.

source: Because UIA programs run at a different "integrity level" than other programs, they can only access objects registered by other UIA programs.
fr: Puisque les programmes UIA sont exécutés à un "integrity level" (niveau d'intégrité) différent de ceux des autres programmes, ils ne peuvent accéder qu'aux objets enregistrés par d'autres programmes UIA.

source: Because the pseudo-array itself doesn't really exist, it can't be passed to or returned from a function, or copied as a whole.
fr: Puisque le pseudo-tableau lui-même n'existe pas vraiment, il ne peut pas être passé à ou renvoyé par une fonction, ou copié comme un tout.

source: Before AutoHotkey can do anything, you need to write a script telling it what to do.
fr: Avant que AutoHotkey puisse faire quoi que ce soit, il faut écrire un script lui disant quoi faire.

source: Before learning to use AutoHotkey (AHK), you will need to download it.
fr: Avant d'apprendre à utiliser AutoHotkey (AHK), il faut le télécharger.

source: Before performing a double reference, the name of the target variable is stored in a second variable.
fr: Avant d'effectuer une double référence, le nom de la variable cible est stockée dans une deuxième variable.

source: Before we begin our journey, let me give some advice.
fr: Avant d'entamer le voyage, quelques conseils.

source: Before you ask, try doing some research yourself or try to code it yourself.
fr: Avant de demander de l'aide, faire des recherches par soi-même ou essayer soi-même le code.

source: Beginner Tutorial | AutoHotkey
fr: Tutoriel Débutant | AutoHotkey

source: Behaviour depends on the audio drivers, which are necessarily different to the ones used on XP.
fr: Le comportement dépend des pilotes audio, qui sont forcément différents de ceux utilisés sous XP.

source: Blanking the value out
fr: Affecter la valeur vide

source: Brace syntax
fr: Syntaxe accolade (brace syntax)

source: Bracket notation
fr: Notation crochet (bracket)

source: Bracket syntax
fr: Syntaxe crochet (bracket syntax)

source: But before we get into things, we should talk about some common issues that people have.
fr: Mais avant de continuer, il convient d'aborder quelques problèmes couramment rencontrés.

source: But before we go, here are some other things that I think you should know.
fr: Mais avant de partir, voici quelques autres choses utiles à savoir.
